pitzDailyLagEB/0.orig/phit
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phit;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.666;

boundaryField
{
    inlet
    {
        //type            zeroGradient;
        type    fixedValue;
        value   $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {   
        //type        zeroGradient;
        type      fixedValue;
        value       uniform 1e-10;
    }

    lowerWall
    {
        //type        zeroGradient;
        type      fixedValue;
        value       uniform 1e-10;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //